zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/xdmac.h
/**
 * \brief Component description for PIC32CZ/CA70 XDMAC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_XDMAC_COMPONENT_H_
#define _PIC32CZ_CA70_XDMAC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_XDMAC Extensible DMA Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR XDMAC */
/* ========================================================================== */

/* -------- XDMAC_CIE : (XDMAC Offset: 0x00) (/W 32) Channel Interrupt Enable Register (chid = 0) -------- */

typedef union
{
  struct
  {
    uint32_t BIE:1;                     /**< bit:      0  End of Block Interrupt Enable Bit             */
    uint32_t LIE:1;                     /**< bit:      1  End of Linked List Interrupt Enable Bit       */
    uint32_t DIE:1;                     /**< bit:      2  End of Disable Interrupt Enable Bit           */
    uint32_t FIE:1;                     /**< bit:      3  End of Flush Interrupt Enable Bit             */
    uint32_t RBIE:1;                    /**< bit:      4  Read Bus Error Interrupt Enable Bit           */
    uint32_t WBIE:1;                    /**< bit:      5  Write Bus Error Interrupt Enable Bit          */
    uint32_t ROIE:1;                    /**< bit:      6  Request Overflow Error Interrupt Enable Bit   */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_CIE_bits_t;

#define XDMAC_CIE_BIE_Pos                     (0)                                            /**< (XDMAC_CIE) End of Block Interrupt Enable Bit Position */
#define XDMAC_CIE_BIE_Msk                     (0x1U << XDMAC_CIE_BIE_Pos)                    /**< (XDMAC_CIE) End of Block Interrupt Enable Bit Mask */
#define XDMAC_CIE_LIE_Pos                     (1)                                            /**< (XDMAC_CIE) End of Linked List Interrupt Enable Bit Position */
#define XDMAC_CIE_LIE_Msk                     (0x1U << XDMAC_CIE_LIE_Pos)                    /**< (XDMAC_CIE) End of Linked List Interrupt Enable Bit Mask */
#define XDMAC_CIE_DIE_Pos                     (2)                                            /**< (XDMAC_CIE) End of Disable Interrupt Enable Bit Position */
#define XDMAC_CIE_DIE_Msk                     (0x1U << XDMAC_CIE_DIE_Pos)                    /**< (XDMAC_CIE) End of Disable Interrupt Enable Bit Mask */
#define XDMAC_CIE_FIE_Pos                     (3)                                            /**< (XDMAC_CIE) End of Flush Interrupt Enable Bit Position */
#define XDMAC_CIE_FIE_Msk                     (0x1U << XDMAC_CIE_FIE_Pos)                    /**< (XDMAC_CIE) End of Flush Interrupt Enable Bit Mask */
#define XDMAC_CIE_RBIE_Pos                    (4)                                            /**< (XDMAC_CIE) Read Bus Error Interrupt Enable Bit Position */
#define XDMAC_CIE_RBIE_Msk                    (0x1U << XDMAC_CIE_RBIE_Pos)                   /**< (XDMAC_CIE) Read Bus Error Interrupt Enable Bit Mask */
#define XDMAC_CIE_WBIE_Pos                    (5)                                            /**< (XDMAC_CIE) Write Bus Error Interrupt Enable Bit Position */
#define XDMAC_CIE_WBIE_Msk                    (0x1U << XDMAC_CIE_WBIE_Pos)                   /**< (XDMAC_CIE) Write Bus Error Interrupt Enable Bit Mask */
#define XDMAC_CIE_ROIE_Pos                    (6)                                            /**< (XDMAC_CIE) Request Overflow Error Interrupt Enable Bit Position */
#define XDMAC_CIE_ROIE_Msk                    (0x1U << XDMAC_CIE_ROIE_Pos)                   /**< (XDMAC_CIE) Request Overflow Error Interrupt Enable Bit Mask */
#define XDMAC_CIE_Msk                         (0x0000007FUL)                                 /**< (XDMAC_CIE) Register Mask  */

/* -------- XDMAC_CID : (XDMAC Offset: 0x04) (/W 32) Channel Interrupt Disable Register (chid = 0) -------- */

typedef union
{
  struct
  {
    uint32_t BID:1;                     /**< bit:      0  End of Block Interrupt Disable Bit            */
    uint32_t LID:1;                     /**< bit:      1  End of Linked List Interrupt Disable Bit      */
    uint32_t DID:1;                     /**< bit:      2  End of Disable Interrupt Disable Bit          */
    uint32_t FID:1;                     /**< bit:      3  End of Flush Interrupt Disable Bit            */
    uint32_t RBEID:1;                   /**< bit:      4  Read Bus Error Interrupt Disable Bit          */
    uint32_t WBEID:1;                   /**< bit:      5  Write Bus Error Interrupt Disable Bit         */
    uint32_t ROID:1;                    /**< bit:      6  Request Overflow Error Interrupt Disable Bit  */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_CID_bits_t;

#define XDMAC_CID_BID_Pos                     (0)                                            /**< (XDMAC_CID) End of Block Interrupt Disable Bit Position */
#define XDMAC_CID_BID_Msk                     (0x1U << XDMAC_CID_BID_Pos)                    /**< (XDMAC_CID) End of Block Interrupt Disable Bit Mask */
#define XDMAC_CID_LID_Pos                     (1)                                            /**< (XDMAC_CID) End of Linked List Interrupt Disable Bit Position */
#define XDMAC_CID_LID_Msk                     (0x1U << XDMAC_CID_LID_Pos)                    /**< (XDMAC_CID) End of Linked List Interrupt Disable Bit Mask */
#define XDMAC_CID_DID_Pos                     (2)                                            /**< (XDMAC_CID) End of Disable Interrupt Disable Bit Position */
#define XDMAC_CID_DID_Msk                     (0x1U << XDMAC_CID_DID_Pos)                    /**< (XDMAC_CID) End of Disable Interrupt Disable Bit Mask */
#define XDMAC_CID_FID_Pos                     (3)                                            /**< (XDMAC_CID) End of Flush Interrupt Disable Bit Position */
#define XDMAC_CID_FID_Msk                     (0x1U << XDMAC_CID_FID_Pos)                    /**< (XDMAC_CID) End of Flush Interrupt Disable Bit Mask */
#define XDMAC_CID_RBEID_Pos                   (4)                                            /**< (XDMAC_CID) Read Bus Error Interrupt Disable Bit Position */
#define XDMAC_CID_RBEID_Msk                   (0x1U << XDMAC_CID_RBEID_Pos)                  /**< (XDMAC_CID) Read Bus Error Interrupt Disable Bit Mask */
#define XDMAC_CID_WBEID_Pos                   (5)                                            /**< (XDMAC_CID) Write Bus Error Interrupt Disable Bit Position */
#define XDMAC_CID_WBEID_Msk                   (0x1U << XDMAC_CID_WBEID_Pos)                  /**< (XDMAC_CID) Write Bus Error Interrupt Disable Bit Mask */
#define XDMAC_CID_ROID_Pos                    (6)                                            /**< (XDMAC_CID) Request Overflow Error Interrupt Disable Bit Position */
#define XDMAC_CID_ROID_Msk                    (0x1U << XDMAC_CID_ROID_Pos)                   /**< (XDMAC_CID) Request Overflow Error Interrupt Disable Bit Mask */
#define XDMAC_CID_Msk                         (0x0000007FUL)                                 /**< (XDMAC_CID) Register Mask  */

