zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/xdmac.h
/* -------- XDMAC_CIM : (XDMAC Offset: 0x08) (R/ 32) Channel Interrupt Mask Register (chid = 0) -------- */

typedef union
{
  struct
  {
    uint32_t BIM:1;                     /**< bit:      0  End of Block Interrupt Mask Bit               */
    uint32_t LIM:1;                     /**< bit:      1  End of Linked List Interrupt Mask Bit         */
    uint32_t DIM:1;                     /**< bit:      2  End of Disable Interrupt Mask Bit             */
    uint32_t FIM:1;                     /**< bit:      3  End of Flush Interrupt Mask Bit               */
    uint32_t RBEIM:1;                   /**< bit:      4  Read Bus Error Interrupt Mask Bit             */
    uint32_t WBEIM:1;                   /**< bit:      5  Write Bus Error Interrupt Mask Bit            */
    uint32_t ROIM:1;                    /**< bit:      6  Request Overflow Error Interrupt Mask Bit     */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_CIM_bits_t;

#define XDMAC_CIM_BIM_Pos                     (0)                                            /**< (XDMAC_CIM) End of Block Interrupt Mask Bit Position */
#define XDMAC_CIM_BIM_Msk                     (0x1U << XDMAC_CIM_BIM_Pos)                    /**< (XDMAC_CIM) End of Block Interrupt Mask Bit Mask */
#define XDMAC_CIM_LIM_Pos                     (1)                                            /**< (XDMAC_CIM) End of Linked List Interrupt Mask Bit Position */
#define XDMAC_CIM_LIM_Msk                     (0x1U << XDMAC_CIM_LIM_Pos)                    /**< (XDMAC_CIM) End of Linked List Interrupt Mask Bit Mask */
#define XDMAC_CIM_DIM_Pos                     (2)                                            /**< (XDMAC_CIM) End of Disable Interrupt Mask Bit Position */
#define XDMAC_CIM_DIM_Msk                     (0x1U << XDMAC_CIM_DIM_Pos)                    /**< (XDMAC_CIM) End of Disable Interrupt Mask Bit Mask */
#define XDMAC_CIM_FIM_Pos                     (3)                                            /**< (XDMAC_CIM) End of Flush Interrupt Mask Bit Position */
#define XDMAC_CIM_FIM_Msk                     (0x1U << XDMAC_CIM_FIM_Pos)                    /**< (XDMAC_CIM) End of Flush Interrupt Mask Bit Mask */
#define XDMAC_CIM_RBEIM_Pos                   (4)                                            /**< (XDMAC_CIM) Read Bus Error Interrupt Mask Bit Position */
#define XDMAC_CIM_RBEIM_Msk                   (0x1U << XDMAC_CIM_RBEIM_Pos)                  /**< (XDMAC_CIM) Read Bus Error Interrupt Mask Bit Mask */
#define XDMAC_CIM_WBEIM_Pos                   (5)                                            /**< (XDMAC_CIM) Write Bus Error Interrupt Mask Bit Position */
#define XDMAC_CIM_WBEIM_Msk                   (0x1U << XDMAC_CIM_WBEIM_Pos)                  /**< (XDMAC_CIM) Write Bus Error Interrupt Mask Bit Mask */
#define XDMAC_CIM_ROIM_Pos                    (6)                                            /**< (XDMAC_CIM) Request Overflow Error Interrupt Mask Bit Position */
#define XDMAC_CIM_ROIM_Msk                    (0x1U << XDMAC_CIM_ROIM_Pos)                   /**< (XDMAC_CIM) Request Overflow Error Interrupt Mask Bit Mask */
#define XDMAC_CIM_Msk                         (0x0000007FUL)                                 /**< (XDMAC_CIM) Register Mask  */

/* -------- XDMAC_CIS : (XDMAC Offset: 0x0c) (R/ 32) Channel Interrupt Status Register (chid = 0) -------- */

typedef union
{
  struct
  {
    uint32_t BIS:1;                     /**< bit:      0  End of Block Interrupt Status Bit             */
    uint32_t LIS:1;                     /**< bit:      1  End of Linked List Interrupt Status Bit       */
    uint32_t DIS:1;                     /**< bit:      2  End of Disable Interrupt Status Bit           */
    uint32_t FIS:1;                     /**< bit:      3  End of Flush Interrupt Status Bit             */
    uint32_t RBEIS:1;                   /**< bit:      4  Read Bus Error Interrupt Status Bit           */
    uint32_t WBEIS:1;                   /**< bit:      5  Write Bus Error Interrupt Status Bit          */
    uint32_t ROIS:1;                    /**< bit:      6  Request Overflow Error Interrupt Status Bit   */
    uint32_t :25;                       /**< bit:  7..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_CIS_bits_t;

#define XDMAC_CIS_BIS_Pos                     (0)                                            /**< (XDMAC_CIS) End of Block Interrupt Status Bit Position */
#define XDMAC_CIS_BIS_Msk                     (0x1U << XDMAC_CIS_BIS_Pos)                    /**< (XDMAC_CIS) End of Block Interrupt Status Bit Mask */
#define XDMAC_CIS_LIS_Pos                     (1)                                            /**< (XDMAC_CIS) End of Linked List Interrupt Status Bit Position */
#define XDMAC_CIS_LIS_Msk                     (0x1U << XDMAC_CIS_LIS_Pos)                    /**< (XDMAC_CIS) End of Linked List Interrupt Status Bit Mask */
#define XDMAC_CIS_DIS_Pos                     (2)                                            /**< (XDMAC_CIS) End of Disable Interrupt Status Bit Position */
#define XDMAC_CIS_DIS_Msk                     (0x1U << XDMAC_CIS_DIS_Pos)                    /**< (XDMAC_CIS) End of Disable Interrupt Status Bit Mask */
#define XDMAC_CIS_FIS_Pos                     (3)                                            /**< (XDMAC_CIS) End of Flush Interrupt Status Bit Position */
#define XDMAC_CIS_FIS_Msk                     (0x1U << XDMAC_CIS_FIS_Pos)                    /**< (XDMAC_CIS) End of Flush Interrupt Status Bit Mask */
#define XDMAC_CIS_RBEIS_Pos                   (4)                                            /**< (XDMAC_CIS) Read Bus Error Interrupt Status Bit Position */
#define XDMAC_CIS_RBEIS_Msk                   (0x1U << XDMAC_CIS_RBEIS_Pos)                  /**< (XDMAC_CIS) Read Bus Error Interrupt Status Bit Mask */
#define XDMAC_CIS_WBEIS_Pos                   (5)                                            /**< (XDMAC_CIS) Write Bus Error Interrupt Status Bit Position */
#define XDMAC_CIS_WBEIS_Msk                   (0x1U << XDMAC_CIS_WBEIS_Pos)                  /**< (XDMAC_CIS) Write Bus Error Interrupt Status Bit Mask */
#define XDMAC_CIS_ROIS_Pos                    (6)                                            /**< (XDMAC_CIS) Request Overflow Error Interrupt Status Bit Position */
#define XDMAC_CIS_ROIS_Msk                    (0x1U << XDMAC_CIS_ROIS_Pos)                   /**< (XDMAC_CIS) Request Overflow Error Interrupt Status Bit Mask */
#define XDMAC_CIS_Msk                         (0x0000007FUL)                                 /**< (XDMAC_CIS) Register Mask  */

/* -------- XDMAC_CSA : (XDMAC Offset: 0x10) (R/W 32) Channel Source Address Register (chid = 0) -------- */

typedef union
{
  struct
  {
    uint32_t SA:32;                     /**< bit:  0..31  Channel x Source Address                      */
  };
  uint32_t w;
} __XDMAC_CSA_bits_t;

