zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/xdmac.h
/* -------- XDMAC_CSUS : (XDMAC Offset: 0x30) (R/W 32) Channel Source Microblock Stride (chid = 0) -------- */

typedef union
{
  struct
  {
    uint32_t SUBS:24;                   /**< bit:  0..23  Channel x Source Microblock Stride            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_CSUS_bits_t;

#define XDMAC_CSUS_SUBS_Pos                   (0)                                            /**< (XDMAC_CSUS) Channel x Source Microblock Stride Position */
#define XDMAC_CSUS_SUBS_Msk                   (0xFFFFFFU << XDMAC_CSUS_SUBS_Pos)             /**< (XDMAC_CSUS) Channel x Source Microblock Stride Mask */
#define XDMAC_CSUS_SUBS(value)                (XDMAC_CSUS_SUBS_Msk & ((value) << XDMAC_CSUS_SUBS_Pos))
#define XDMAC_CSUS_Msk                        (0x00FFFFFFUL)                                 /**< (XDMAC_CSUS) Register Mask  */

/* -------- XDMAC_CDUS : (XDMAC Offset: 0x34) (R/W 32) Channel Destination Microblock Stride (chid = 0) -------- */

typedef union
{
  struct
  {
    uint32_t DUBS:24;                   /**< bit:  0..23  Channel x Destination Microblock Stride       */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_CDUS_bits_t;

#define XDMAC_CDUS_DUBS_Pos                   (0)                                            /**< (XDMAC_CDUS) Channel x Destination Microblock Stride Position */
#define XDMAC_CDUS_DUBS_Msk                   (0xFFFFFFU << XDMAC_CDUS_DUBS_Pos)             /**< (XDMAC_CDUS) Channel x Destination Microblock Stride Mask */
#define XDMAC_CDUS_DUBS(value)                (XDMAC_CDUS_DUBS_Msk & ((value) << XDMAC_CDUS_DUBS_Pos))
#define XDMAC_CDUS_Msk                        (0x00FFFFFFUL)                                 /**< (XDMAC_CDUS) Register Mask  */

/* -------- XDMAC_GTYPE : (XDMAC Offset: 0x00) (R/ 32) Global Type Register -------- */

typedef union
{
  struct
  {
    uint32_t NB_CH:5;                   /**< bit:   0..4  Number of Channels Minus One                  */
    uint32_t FIFO_SZ:11;                /**< bit:  5..15  Number of Bytes                               */
    uint32_t NB_REQ:7;                  /**< bit: 16..22  Number of Peripheral Requests Minus One       */
    uint32_t :9;                        /**< bit: 23..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GTYPE_bits_t;

#define XDMAC_GTYPE_NB_CH_Pos                 (0)                                            /**< (XDMAC_GTYPE) Number of Channels Minus One Position */
#define XDMAC_GTYPE_NB_CH_Msk                 (0x1FU << XDMAC_GTYPE_NB_CH_Pos)               /**< (XDMAC_GTYPE) Number of Channels Minus One Mask */
#define XDMAC_GTYPE_NB_CH(value)              (XDMAC_GTYPE_NB_CH_Msk & ((value) << XDMAC_GTYPE_NB_CH_Pos))
#define XDMAC_GTYPE_FIFO_SZ_Pos               (5)                                            /**< (XDMAC_GTYPE) Number of Bytes Position */
#define XDMAC_GTYPE_FIFO_SZ_Msk               (0x7FFU << XDMAC_GTYPE_FIFO_SZ_Pos)            /**< (XDMAC_GTYPE) Number of Bytes Mask */
#define XDMAC_GTYPE_FIFO_SZ(value)            (XDMAC_GTYPE_FIFO_SZ_Msk & ((value) << XDMAC_GTYPE_FIFO_SZ_Pos))
#define XDMAC_GTYPE_NB_REQ_Pos                (16)                                           /**< (XDMAC_GTYPE) Number of Peripheral Requests Minus One Position */
#define XDMAC_GTYPE_NB_REQ_Msk                (0x7FU << XDMAC_GTYPE_NB_REQ_Pos)              /**< (XDMAC_GTYPE) Number of Peripheral Requests Minus One Mask */
#define XDMAC_GTYPE_NB_REQ(value)             (XDMAC_GTYPE_NB_REQ_Msk & ((value) << XDMAC_GTYPE_NB_REQ_Pos))
#define XDMAC_GTYPE_Msk                       (0x007FFFFFUL)                                 /**< (XDMAC_GTYPE) Register Mask  */

/* -------- XDMAC_GCFG : (XDMAC Offset: 0x04) (R/W 32) Global Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t CGDISREG:1;                /**< bit:      0  Configuration Registers Clock Gating Disable  */
    uint32_t CGDISPIPE:1;               /**< bit:      1  Pipeline Clock Gating Disable                 */
    uint32_t CGDISFIFO:1;               /**< bit:      2  FIFO Clock Gating Disable                     */
    uint32_t CGDISIF:1;                 /**< bit:      3  Bus Interface Clock Gating Disable            */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t BXKBEN:1;                  /**< bit:      8  Boundary X Kilobyte Enable                    */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GCFG_bits_t;

#define XDMAC_GCFG_CGDISREG_Pos               (0)                                            /**< (XDMAC_GCFG) Configuration Registers Clock Gating Disable Position */
#define XDMAC_GCFG_CGDISREG_Msk               (0x1U << XDMAC_GCFG_CGDISREG_Pos)              /**< (XDMAC_GCFG) Configuration Registers Clock Gating Disable Mask */
#define XDMAC_GCFG_CGDISPIPE_Pos              (1)                                            /**< (XDMAC_GCFG) Pipeline Clock Gating Disable Position */
#define XDMAC_GCFG_CGDISPIPE_Msk              (0x1U << XDMAC_GCFG_CGDISPIPE_Pos)             /**< (XDMAC_GCFG) Pipeline Clock Gating Disable Mask */
#define XDMAC_GCFG_CGDISFIFO_Pos              (2)                                            /**< (XDMAC_GCFG) FIFO Clock Gating Disable Position */
#define XDMAC_GCFG_CGDISFIFO_Msk              (0x1U << XDMAC_GCFG_CGDISFIFO_Pos)             /**< (XDMAC_GCFG) FIFO Clock Gating Disable Mask */
#define XDMAC_GCFG_CGDISIF_Pos                (3)                                            /**< (XDMAC_GCFG) Bus Interface Clock Gating Disable Position */
#define XDMAC_GCFG_CGDISIF_Msk                (0x1U << XDMAC_GCFG_CGDISIF_Pos)               /**< (XDMAC_GCFG) Bus Interface Clock Gating Disable Mask */
#define XDMAC_GCFG_BXKBEN_Pos                 (8)                                            /**< (XDMAC_GCFG) Boundary X Kilobyte Enable Position */
#define XDMAC_GCFG_BXKBEN_Msk                 (0x1U << XDMAC_GCFG_BXKBEN_Pos)                /**< (XDMAC_GCFG) Boundary X Kilobyte Enable Mask */
#define XDMAC_GCFG_Msk                        (0x0000010FUL)                                 /**< (XDMAC_GCFG) Register Mask  */

/* -------- XDMAC_GWAC : (XDMAC Offset: 0x08) (R/W 32) Global Weighted Arbiter Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t PW0:4;                     /**< bit:   0..3  Pool Weight 0                                 */
    uint32_t PW1:4;                     /**< bit:   4..7  Pool Weight 1                                 */
    uint32_t PW2:4;                     /**< bit:  8..11  Pool Weight 2                                 */
    uint32_t PW3:4;                     /**< bit: 12..15  Pool Weight 3                                 */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GWAC_bits_t;

#define XDMAC_GWAC_PW0_Pos                    (0)                                            /**< (XDMAC_GWAC) Pool Weight 0 Position */
#define XDMAC_GWAC_PW0_Msk                    (0xFU << XDMAC_GWAC_PW0_Pos)                   /**< (XDMAC_GWAC) Pool Weight 0 Mask */
#define XDMAC_GWAC_PW0(value)                 (XDMAC_GWAC_PW0_Msk & ((value) << XDMAC_GWAC_PW0_Pos))
#define XDMAC_GWAC_PW1_Pos                    (4)                                            /**< (XDMAC_GWAC) Pool Weight 1 Position */
#define XDMAC_GWAC_PW1_Msk                    (0xFU << XDMAC_GWAC_PW1_Pos)                   /**< (XDMAC_GWAC) Pool Weight 1 Mask */
#define XDMAC_GWAC_PW1(value)                 (XDMAC_GWAC_PW1_Msk & ((value) << XDMAC_GWAC_PW1_Pos))
#define XDMAC_GWAC_PW2_Pos                    (8)                                            /**< (XDMAC_GWAC) Pool Weight 2 Position */
#define XDMAC_GWAC_PW2_Msk                    (0xFU << XDMAC_GWAC_PW2_Pos)                   /**< (XDMAC_GWAC) Pool Weight 2 Mask */
#define XDMAC_GWAC_PW2(value)                 (XDMAC_GWAC_PW2_Msk & ((value) << XDMAC_GWAC_PW2_Pos))
#define XDMAC_GWAC_PW3_Pos                    (12)                                           /**< (XDMAC_GWAC) Pool Weight 3 Position */
#define XDMAC_GWAC_PW3_Msk                    (0xFU << XDMAC_GWAC_PW3_Pos)                   /**< (XDMAC_GWAC) Pool Weight 3 Mask */
#define XDMAC_GWAC_PW3(value)                 (XDMAC_GWAC_PW3_Msk & ((value) << XDMAC_GWAC_PW3_Pos))
#define XDMAC_GWAC_Msk                        (0x0000FFFFUL)                                 /**< (XDMAC_GWAC) Register Mask  */

