zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/xdmac.h
#define XDMAC_GIS_IS0_Pos                     (0)                                            /**< (XDMAC_GIS) XDMAC Channel 0 Interrupt Status Bit Position */
#define XDMAC_GIS_IS0_Msk                     (0x1U << XDMAC_GIS_IS0_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 0 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS1_Pos                     (1)                                            /**< (XDMAC_GIS) XDMAC Channel 1 Interrupt Status Bit Position */
#define XDMAC_GIS_IS1_Msk                     (0x1U << XDMAC_GIS_IS1_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 1 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS2_Pos                     (2)                                            /**< (XDMAC_GIS) XDMAC Channel 2 Interrupt Status Bit Position */
#define XDMAC_GIS_IS2_Msk                     (0x1U << XDMAC_GIS_IS2_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 2 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS3_Pos                     (3)                                            /**< (XDMAC_GIS) XDMAC Channel 3 Interrupt Status Bit Position */
#define XDMAC_GIS_IS3_Msk                     (0x1U << XDMAC_GIS_IS3_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 3 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS4_Pos                     (4)                                            /**< (XDMAC_GIS) XDMAC Channel 4 Interrupt Status Bit Position */
#define XDMAC_GIS_IS4_Msk                     (0x1U << XDMAC_GIS_IS4_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 4 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS5_Pos                     (5)                                            /**< (XDMAC_GIS) XDMAC Channel 5 Interrupt Status Bit Position */
#define XDMAC_GIS_IS5_Msk                     (0x1U << XDMAC_GIS_IS5_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 5 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS6_Pos                     (6)                                            /**< (XDMAC_GIS) XDMAC Channel 6 Interrupt Status Bit Position */
#define XDMAC_GIS_IS6_Msk                     (0x1U << XDMAC_GIS_IS6_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 6 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS7_Pos                     (7)                                            /**< (XDMAC_GIS) XDMAC Channel 7 Interrupt Status Bit Position */
#define XDMAC_GIS_IS7_Msk                     (0x1U << XDMAC_GIS_IS7_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 7 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS8_Pos                     (8)                                            /**< (XDMAC_GIS) XDMAC Channel 8 Interrupt Status Bit Position */
#define XDMAC_GIS_IS8_Msk                     (0x1U << XDMAC_GIS_IS8_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 8 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS9_Pos                     (9)                                            /**< (XDMAC_GIS) XDMAC Channel 9 Interrupt Status Bit Position */
#define XDMAC_GIS_IS9_Msk                     (0x1U << XDMAC_GIS_IS9_Pos)                    /**< (XDMAC_GIS) XDMAC Channel 9 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS10_Pos                    (10)                                           /**< (XDMAC_GIS) XDMAC Channel 10 Interrupt Status Bit Position */
#define XDMAC_GIS_IS10_Msk                    (0x1U << XDMAC_GIS_IS10_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 10 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS11_Pos                    (11)                                           /**< (XDMAC_GIS) XDMAC Channel 11 Interrupt Status Bit Position */
#define XDMAC_GIS_IS11_Msk                    (0x1U << XDMAC_GIS_IS11_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 11 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS12_Pos                    (12)                                           /**< (XDMAC_GIS) XDMAC Channel 12 Interrupt Status Bit Position */
#define XDMAC_GIS_IS12_Msk                    (0x1U << XDMAC_GIS_IS12_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 12 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS13_Pos                    (13)                                           /**< (XDMAC_GIS) XDMAC Channel 13 Interrupt Status Bit Position */
#define XDMAC_GIS_IS13_Msk                    (0x1U << XDMAC_GIS_IS13_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 13 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS14_Pos                    (14)                                           /**< (XDMAC_GIS) XDMAC Channel 14 Interrupt Status Bit Position */
#define XDMAC_GIS_IS14_Msk                    (0x1U << XDMAC_GIS_IS14_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 14 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS15_Pos                    (15)                                           /**< (XDMAC_GIS) XDMAC Channel 15 Interrupt Status Bit Position */
#define XDMAC_GIS_IS15_Msk                    (0x1U << XDMAC_GIS_IS15_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 15 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS16_Pos                    (16)                                           /**< (XDMAC_GIS) XDMAC Channel 16 Interrupt Status Bit Position */
#define XDMAC_GIS_IS16_Msk                    (0x1U << XDMAC_GIS_IS16_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 16 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS17_Pos                    (17)                                           /**< (XDMAC_GIS) XDMAC Channel 17 Interrupt Status Bit Position */
#define XDMAC_GIS_IS17_Msk                    (0x1U << XDMAC_GIS_IS17_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 17 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS18_Pos                    (18)                                           /**< (XDMAC_GIS) XDMAC Channel 18 Interrupt Status Bit Position */
#define XDMAC_GIS_IS18_Msk                    (0x1U << XDMAC_GIS_IS18_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 18 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS19_Pos                    (19)                                           /**< (XDMAC_GIS) XDMAC Channel 19 Interrupt Status Bit Position */
#define XDMAC_GIS_IS19_Msk                    (0x1U << XDMAC_GIS_IS19_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 19 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS20_Pos                    (20)                                           /**< (XDMAC_GIS) XDMAC Channel 20 Interrupt Status Bit Position */
#define XDMAC_GIS_IS20_Msk                    (0x1U << XDMAC_GIS_IS20_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 20 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS21_Pos                    (21)                                           /**< (XDMAC_GIS) XDMAC Channel 21 Interrupt Status Bit Position */
#define XDMAC_GIS_IS21_Msk                    (0x1U << XDMAC_GIS_IS21_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 21 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS22_Pos                    (22)                                           /**< (XDMAC_GIS) XDMAC Channel 22 Interrupt Status Bit Position */
#define XDMAC_GIS_IS22_Msk                    (0x1U << XDMAC_GIS_IS22_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 22 Interrupt Status Bit Mask */
#define XDMAC_GIS_IS23_Pos                    (23)                                           /**< (XDMAC_GIS) XDMAC Channel 23 Interrupt Status Bit Position */
#define XDMAC_GIS_IS23_Msk                    (0x1U << XDMAC_GIS_IS23_Pos)                   /**< (XDMAC_GIS) XDMAC Channel 23 Interrupt Status Bit Mask */
#define XDMAC_GIS_Msk                         (0x00FFFFFFUL)                                 /**< (XDMAC_GIS) Register Mask  */
#define XDMAC_GIS_IS_Pos                      (0)                                            /**< (XDMAC_GIS Position) XDMAC Channel 23 Interrupt Status Bit */
#define XDMAC_GIS_IS_Msk                      (0xFFFFFFU << XDMAC_GIS_IS_Pos)                /**< (XDMAC_GIS Mask) IS */
#define XDMAC_GIS_IS(value)                   (XDMAC_GIS_IS_Msk & ((value) << XDMAC_GIS_IS_Pos))

/* -------- XDMAC_GE : (XDMAC Offset: 0x1c) (/W 32) Global Channel Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t EN0:1;                     /**< bit:      0  XDMAC Channel 0 Enable Bit                    */
    uint32_t EN1:1;                     /**< bit:      1  XDMAC Channel 1 Enable Bit                    */
    uint32_t EN2:1;                     /**< bit:      2  XDMAC Channel 2 Enable Bit                    */
    uint32_t EN3:1;                     /**< bit:      3  XDMAC Channel 3 Enable Bit                    */
    uint32_t EN4:1;                     /**< bit:      4  XDMAC Channel 4 Enable Bit                    */
    uint32_t EN5:1;                     /**< bit:      5  XDMAC Channel 5 Enable Bit                    */
    uint32_t EN6:1;                     /**< bit:      6  XDMAC Channel 6 Enable Bit                    */
    uint32_t EN7:1;                     /**< bit:      7  XDMAC Channel 7 Enable Bit                    */
    uint32_t EN8:1;                     /**< bit:      8  XDMAC Channel 8 Enable Bit                    */
    uint32_t EN9:1;                     /**< bit:      9  XDMAC Channel 9 Enable Bit                    */
    uint32_t EN10:1;                    /**< bit:     10  XDMAC Channel 10 Enable Bit                   */
    uint32_t EN11:1;                    /**< bit:     11  XDMAC Channel 11 Enable Bit                   */
    uint32_t EN12:1;                    /**< bit:     12  XDMAC Channel 12 Enable Bit                   */
    uint32_t EN13:1;                    /**< bit:     13  XDMAC Channel 13 Enable Bit                   */
    uint32_t EN14:1;                    /**< bit:     14  XDMAC Channel 14 Enable Bit                   */
    uint32_t EN15:1;                    /**< bit:     15  XDMAC Channel 15 Enable Bit                   */
    uint32_t EN16:1;                    /**< bit:     16  XDMAC Channel 16 Enable Bit                   */
    uint32_t EN17:1;                    /**< bit:     17  XDMAC Channel 17 Enable Bit                   */
    uint32_t EN18:1;                    /**< bit:     18  XDMAC Channel 18 Enable Bit                   */
    uint32_t EN19:1;                    /**< bit:     19  XDMAC Channel 19 Enable Bit                   */
    uint32_t EN20:1;                    /**< bit:     20  XDMAC Channel 20 Enable Bit                   */
    uint32_t EN21:1;                    /**< bit:     21  XDMAC Channel 21 Enable Bit                   */
    uint32_t EN22:1;                    /**< bit:     22  XDMAC Channel 22 Enable Bit                   */
    uint32_t EN23:1;                    /**< bit:     23  XDMAC Channel 23 Enable Bit                   */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t EN:24;                     /**< bit:  0..23  XDMAC Channel 23 Enable Bit                   */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GE_bits_t;

#define XDMAC_GE_EN0_Pos                      (0)                                            /**< (XDMAC_GE) XDMAC Channel 0 Enable Bit Position */
#define XDMAC_GE_EN0_Msk                      (0x1U << XDMAC_GE_EN0_Pos)                     /**< (XDMAC_GE) XDMAC Channel 0 Enable Bit Mask */
#define XDMAC_GE_EN1_Pos                      (1)                                            /**< (XDMAC_GE) XDMAC Channel 1 Enable Bit Position */
#define XDMAC_GE_EN1_Msk                      (0x1U << XDMAC_GE_EN1_Pos)                     /**< (XDMAC_GE) XDMAC Channel 1 Enable Bit Mask */
#define XDMAC_GE_EN2_Pos                      (2)                                            /**< (XDMAC_GE) XDMAC Channel 2 Enable Bit Position */
#define XDMAC_GE_EN2_Msk                      (0x1U << XDMAC_GE_EN2_Pos)                     /**< (XDMAC_GE) XDMAC Channel 2 Enable Bit Mask */
#define XDMAC_GE_EN3_Pos                      (3)                                            /**< (XDMAC_GE) XDMAC Channel 3 Enable Bit Position */
#define XDMAC_GE_EN3_Msk                      (0x1U << XDMAC_GE_EN3_Pos)                     /**< (XDMAC_GE) XDMAC Channel 3 Enable Bit Mask */
#define XDMAC_GE_EN4_Pos                      (4)                                            /**< (XDMAC_GE) XDMAC Channel 4 Enable Bit Position */
#define XDMAC_GE_EN4_Msk                      (0x1U << XDMAC_GE_EN4_Pos)                     /**< (XDMAC_GE) XDMAC Channel 4 Enable Bit Mask */
#define XDMAC_GE_EN5_Pos                      (5)                                            /**< (XDMAC_GE) XDMAC Channel 5 Enable Bit Position */
#define XDMAC_GE_EN5_Msk                      (0x1U << XDMAC_GE_EN5_Pos)                     /**< (XDMAC_GE) XDMAC Channel 5 Enable Bit Mask */
#define XDMAC_GE_EN6_Pos                      (6)                                            /**< (XDMAC_GE) XDMAC Channel 6 Enable Bit Position */
#define XDMAC_GE_EN6_Msk                      (0x1U << XDMAC_GE_EN6_Pos)                     /**< (XDMAC_GE) XDMAC Channel 6 Enable Bit Mask */
#define XDMAC_GE_EN7_Pos                      (7)                                            /**< (XDMAC_GE) XDMAC Channel 7 Enable Bit Position */
#define XDMAC_GE_EN7_Msk                      (0x1U << XDMAC_GE_EN7_Pos)                     /**< (XDMAC_GE) XDMAC Channel 7 Enable Bit Mask */
#define XDMAC_GE_EN8_Pos                      (8)                                            /**< (XDMAC_GE) XDMAC Channel 8 Enable Bit Position */
#define XDMAC_GE_EN8_Msk                      (0x1U << XDMAC_GE_EN8_Pos)                     /**< (XDMAC_GE) XDMAC Channel 8 Enable Bit Mask */
#define XDMAC_GE_EN9_Pos                      (9)                                            /**< (XDMAC_GE) XDMAC Channel 9 Enable Bit Position */
#define XDMAC_GE_EN9_Msk                      (0x1U << XDMAC_GE_EN9_Pos)                     /**< (XDMAC_GE) XDMAC Channel 9 Enable Bit Mask */
#define XDMAC_GE_EN10_Pos                     (10)                                           /**< (XDMAC_GE) XDMAC Channel 10 Enable Bit Position */
#define XDMAC_GE_EN10_Msk                     (0x1U << XDMAC_GE_EN10_Pos)                    /**< (XDMAC_GE) XDMAC Channel 10 Enable Bit Mask */
#define XDMAC_GE_EN11_Pos                     (11)                                           /**< (XDMAC_GE) XDMAC Channel 11 Enable Bit Position */
#define XDMAC_GE_EN11_Msk                     (0x1U << XDMAC_GE_EN11_Pos)                    /**< (XDMAC_GE) XDMAC Channel 11 Enable Bit Mask */
#define XDMAC_GE_EN12_Pos                     (12)                                           /**< (XDMAC_GE) XDMAC Channel 12 Enable Bit Position */
#define XDMAC_GE_EN12_Msk                     (0x1U << XDMAC_GE_EN12_Pos)                    /**< (XDMAC_GE) XDMAC Channel 12 Enable Bit Mask */
#define XDMAC_GE_EN13_Pos                     (13)                                           /**< (XDMAC_GE) XDMAC Channel 13 Enable Bit Position */
#define XDMAC_GE_EN13_Msk                     (0x1U << XDMAC_GE_EN13_Pos)                    /**< (XDMAC_GE) XDMAC Channel 13 Enable Bit Mask */
#define XDMAC_GE_EN14_Pos                     (14)                                           /**< (XDMAC_GE) XDMAC Channel 14 Enable Bit Position */
#define XDMAC_GE_EN14_Msk                     (0x1U << XDMAC_GE_EN14_Pos)                    /**< (XDMAC_GE) XDMAC Channel 14 Enable Bit Mask */
#define XDMAC_GE_EN15_Pos                     (15)                                           /**< (XDMAC_GE) XDMAC Channel 15 Enable Bit Position */
#define XDMAC_GE_EN15_Msk                     (0x1U << XDMAC_GE_EN15_Pos)                    /**< (XDMAC_GE) XDMAC Channel 15 Enable Bit Mask */
#define XDMAC_GE_EN16_Pos                     (16)                                           /**< (XDMAC_GE) XDMAC Channel 16 Enable Bit Position */
#define XDMAC_GE_EN16_Msk                     (0x1U << XDMAC_GE_EN16_Pos)                    /**< (XDMAC_GE) XDMAC Channel 16 Enable Bit Mask */
#define XDMAC_GE_EN17_Pos                     (17)                                           /**< (XDMAC_GE) XDMAC Channel 17 Enable Bit Position */
#define XDMAC_GE_EN17_Msk                     (0x1U << XDMAC_GE_EN17_Pos)                    /**< (XDMAC_GE) XDMAC Channel 17 Enable Bit Mask */
#define XDMAC_GE_EN18_Pos                     (18)                                           /**< (XDMAC_GE) XDMAC Channel 18 Enable Bit Position */
#define XDMAC_GE_EN18_Msk                     (0x1U << XDMAC_GE_EN18_Pos)                    /**< (XDMAC_GE) XDMAC Channel 18 Enable Bit Mask */
#define XDMAC_GE_EN19_Pos                     (19)                                           /**< (XDMAC_GE) XDMAC Channel 19 Enable Bit Position */
#define XDMAC_GE_EN19_Msk                     (0x1U << XDMAC_GE_EN19_Pos)                    /**< (XDMAC_GE) XDMAC Channel 19 Enable Bit Mask */
#define XDMAC_GE_EN20_Pos                     (20)                                           /**< (XDMAC_GE) XDMAC Channel 20 Enable Bit Position */
#define XDMAC_GE_EN20_Msk                     (0x1U << XDMAC_GE_EN20_Pos)                    /**< (XDMAC_GE) XDMAC Channel 20 Enable Bit Mask */
#define XDMAC_GE_EN21_Pos                     (21)                                           /**< (XDMAC_GE) XDMAC Channel 21 Enable Bit Position */
#define XDMAC_GE_EN21_Msk                     (0x1U << XDMAC_GE_EN21_Pos)                    /**< (XDMAC_GE) XDMAC Channel 21 Enable Bit Mask */
#define XDMAC_GE_EN22_Pos                     (22)                                           /**< (XDMAC_GE) XDMAC Channel 22 Enable Bit Position */
#define XDMAC_GE_EN22_Msk                     (0x1U << XDMAC_GE_EN22_Pos)                    /**< (XDMAC_GE) XDMAC Channel 22 Enable Bit Mask */
#define XDMAC_GE_EN23_Pos                     (23)                                           /**< (XDMAC_GE) XDMAC Channel 23 Enable Bit Position */
#define XDMAC_GE_EN23_Msk                     (0x1U << XDMAC_GE_EN23_Pos)                    /**< (XDMAC_GE) XDMAC Channel 23 Enable Bit Mask */
#define XDMAC_GE_Msk                          (0x00FFFFFFUL)                                 /**< (XDMAC_GE) Register Mask  */
#define XDMAC_GE_EN_Pos                       (0)                                            /**< (XDMAC_GE Position) XDMAC Channel 23 Enable Bit */
#define XDMAC_GE_EN_Msk                       (0xFFFFFFU << XDMAC_GE_EN_Pos)                 /**< (XDMAC_GE Mask) EN */
#define XDMAC_GE_EN(value)                    (XDMAC_GE_EN_Msk & ((value) << XDMAC_GE_EN_Pos))

/* -------- XDMAC_GD : (XDMAC Offset: 0x20) (/W 32) Global Channel Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t DI0:1;                     /**< bit:      0  XDMAC Channel 0 Disable Bit                   */
    uint32_t DI1:1;                     /**< bit:      1  XDMAC Channel 1 Disable Bit                   */
    uint32_t DI2:1;                     /**< bit:      2  XDMAC Channel 2 Disable Bit                   */
    uint32_t DI3:1;                     /**< bit:      3  XDMAC Channel 3 Disable Bit                   */
    uint32_t DI4:1;                     /**< bit:      4  XDMAC Channel 4 Disable Bit                   */
    uint32_t DI5:1;                     /**< bit:      5  XDMAC Channel 5 Disable Bit                   */
    uint32_t DI6:1;                     /**< bit:      6  XDMAC Channel 6 Disable Bit                   */
    uint32_t DI7:1;                     /**< bit:      7  XDMAC Channel 7 Disable Bit                   */
    uint32_t DI8:1;                     /**< bit:      8  XDMAC Channel 8 Disable Bit                   */
    uint32_t DI9:1;                     /**< bit:      9  XDMAC Channel 9 Disable Bit                   */
    uint32_t DI10:1;                    /**< bit:     10  XDMAC Channel 10 Disable Bit                  */
    uint32_t DI11:1;                    /**< bit:     11  XDMAC Channel 11 Disable Bit                  */
    uint32_t DI12:1;                    /**< bit:     12  XDMAC Channel 12 Disable Bit                  */
    uint32_t DI13:1;                    /**< bit:     13  XDMAC Channel 13 Disable Bit                  */
    uint32_t DI14:1;                    /**< bit:     14  XDMAC Channel 14 Disable Bit                  */
    uint32_t DI15:1;                    /**< bit:     15  XDMAC Channel 15 Disable Bit                  */
    uint32_t DI16:1;                    /**< bit:     16  XDMAC Channel 16 Disable Bit                  */
    uint32_t DI17:1;                    /**< bit:     17  XDMAC Channel 17 Disable Bit                  */
    uint32_t DI18:1;                    /**< bit:     18  XDMAC Channel 18 Disable Bit                  */
    uint32_t DI19:1;                    /**< bit:     19  XDMAC Channel 19 Disable Bit                  */
    uint32_t DI20:1;                    /**< bit:     20  XDMAC Channel 20 Disable Bit                  */
    uint32_t DI21:1;                    /**< bit:     21  XDMAC Channel 21 Disable Bit                  */
    uint32_t DI22:1;                    /**< bit:     22  XDMAC Channel 22 Disable Bit                  */
    uint32_t DI23:1;                    /**< bit:     23  XDMAC Channel 23 Disable Bit                  */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t DI:24;                     /**< bit:  0..23  XDMAC Channel 23 Disable Bit                  */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GD_bits_t;

