zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/xdmac.h
#define XDMAC_GD_DI0_Pos                      (0)                                            /**< (XDMAC_GD) XDMAC Channel 0 Disable Bit Position */
#define XDMAC_GD_DI0_Msk                      (0x1U << XDMAC_GD_DI0_Pos)                     /**< (XDMAC_GD) XDMAC Channel 0 Disable Bit Mask */
#define XDMAC_GD_DI1_Pos                      (1)                                            /**< (XDMAC_GD) XDMAC Channel 1 Disable Bit Position */
#define XDMAC_GD_DI1_Msk                      (0x1U << XDMAC_GD_DI1_Pos)                     /**< (XDMAC_GD) XDMAC Channel 1 Disable Bit Mask */
#define XDMAC_GD_DI2_Pos                      (2)                                            /**< (XDMAC_GD) XDMAC Channel 2 Disable Bit Position */
#define XDMAC_GD_DI2_Msk                      (0x1U << XDMAC_GD_DI2_Pos)                     /**< (XDMAC_GD) XDMAC Channel 2 Disable Bit Mask */
#define XDMAC_GD_DI3_Pos                      (3)                                            /**< (XDMAC_GD) XDMAC Channel 3 Disable Bit Position */
#define XDMAC_GD_DI3_Msk                      (0x1U << XDMAC_GD_DI3_Pos)                     /**< (XDMAC_GD) XDMAC Channel 3 Disable Bit Mask */
#define XDMAC_GD_DI4_Pos                      (4)                                            /**< (XDMAC_GD) XDMAC Channel 4 Disable Bit Position */
#define XDMAC_GD_DI4_Msk                      (0x1U << XDMAC_GD_DI4_Pos)                     /**< (XDMAC_GD) XDMAC Channel 4 Disable Bit Mask */
#define XDMAC_GD_DI5_Pos                      (5)                                            /**< (XDMAC_GD) XDMAC Channel 5 Disable Bit Position */
#define XDMAC_GD_DI5_Msk                      (0x1U << XDMAC_GD_DI5_Pos)                     /**< (XDMAC_GD) XDMAC Channel 5 Disable Bit Mask */
#define XDMAC_GD_DI6_Pos                      (6)                                            /**< (XDMAC_GD) XDMAC Channel 6 Disable Bit Position */
#define XDMAC_GD_DI6_Msk                      (0x1U << XDMAC_GD_DI6_Pos)                     /**< (XDMAC_GD) XDMAC Channel 6 Disable Bit Mask */
#define XDMAC_GD_DI7_Pos                      (7)                                            /**< (XDMAC_GD) XDMAC Channel 7 Disable Bit Position */
#define XDMAC_GD_DI7_Msk                      (0x1U << XDMAC_GD_DI7_Pos)                     /**< (XDMAC_GD) XDMAC Channel 7 Disable Bit Mask */
#define XDMAC_GD_DI8_Pos                      (8)                                            /**< (XDMAC_GD) XDMAC Channel 8 Disable Bit Position */
#define XDMAC_GD_DI8_Msk                      (0x1U << XDMAC_GD_DI8_Pos)                     /**< (XDMAC_GD) XDMAC Channel 8 Disable Bit Mask */
#define XDMAC_GD_DI9_Pos                      (9)                                            /**< (XDMAC_GD) XDMAC Channel 9 Disable Bit Position */
#define XDMAC_GD_DI9_Msk                      (0x1U << XDMAC_GD_DI9_Pos)                     /**< (XDMAC_GD) XDMAC Channel 9 Disable Bit Mask */
#define XDMAC_GD_DI10_Pos                     (10)                                           /**< (XDMAC_GD) XDMAC Channel 10 Disable Bit Position */
#define XDMAC_GD_DI10_Msk                     (0x1U << XDMAC_GD_DI10_Pos)                    /**< (XDMAC_GD) XDMAC Channel 10 Disable Bit Mask */
#define XDMAC_GD_DI11_Pos                     (11)                                           /**< (XDMAC_GD) XDMAC Channel 11 Disable Bit Position */
#define XDMAC_GD_DI11_Msk                     (0x1U << XDMAC_GD_DI11_Pos)                    /**< (XDMAC_GD) XDMAC Channel 11 Disable Bit Mask */
#define XDMAC_GD_DI12_Pos                     (12)                                           /**< (XDMAC_GD) XDMAC Channel 12 Disable Bit Position */
#define XDMAC_GD_DI12_Msk                     (0x1U << XDMAC_GD_DI12_Pos)                    /**< (XDMAC_GD) XDMAC Channel 12 Disable Bit Mask */
#define XDMAC_GD_DI13_Pos                     (13)                                           /**< (XDMAC_GD) XDMAC Channel 13 Disable Bit Position */
#define XDMAC_GD_DI13_Msk                     (0x1U << XDMAC_GD_DI13_Pos)                    /**< (XDMAC_GD) XDMAC Channel 13 Disable Bit Mask */
#define XDMAC_GD_DI14_Pos                     (14)                                           /**< (XDMAC_GD) XDMAC Channel 14 Disable Bit Position */
#define XDMAC_GD_DI14_Msk                     (0x1U << XDMAC_GD_DI14_Pos)                    /**< (XDMAC_GD) XDMAC Channel 14 Disable Bit Mask */
#define XDMAC_GD_DI15_Pos                     (15)                                           /**< (XDMAC_GD) XDMAC Channel 15 Disable Bit Position */
#define XDMAC_GD_DI15_Msk                     (0x1U << XDMAC_GD_DI15_Pos)                    /**< (XDMAC_GD) XDMAC Channel 15 Disable Bit Mask */
#define XDMAC_GD_DI16_Pos                     (16)                                           /**< (XDMAC_GD) XDMAC Channel 16 Disable Bit Position */
#define XDMAC_GD_DI16_Msk                     (0x1U << XDMAC_GD_DI16_Pos)                    /**< (XDMAC_GD) XDMAC Channel 16 Disable Bit Mask */
#define XDMAC_GD_DI17_Pos                     (17)                                           /**< (XDMAC_GD) XDMAC Channel 17 Disable Bit Position */
#define XDMAC_GD_DI17_Msk                     (0x1U << XDMAC_GD_DI17_Pos)                    /**< (XDMAC_GD) XDMAC Channel 17 Disable Bit Mask */
#define XDMAC_GD_DI18_Pos                     (18)                                           /**< (XDMAC_GD) XDMAC Channel 18 Disable Bit Position */
#define XDMAC_GD_DI18_Msk                     (0x1U << XDMAC_GD_DI18_Pos)                    /**< (XDMAC_GD) XDMAC Channel 18 Disable Bit Mask */
#define XDMAC_GD_DI19_Pos                     (19)                                           /**< (XDMAC_GD) XDMAC Channel 19 Disable Bit Position */
#define XDMAC_GD_DI19_Msk                     (0x1U << XDMAC_GD_DI19_Pos)                    /**< (XDMAC_GD) XDMAC Channel 19 Disable Bit Mask */
#define XDMAC_GD_DI20_Pos                     (20)                                           /**< (XDMAC_GD) XDMAC Channel 20 Disable Bit Position */
#define XDMAC_GD_DI20_Msk                     (0x1U << XDMAC_GD_DI20_Pos)                    /**< (XDMAC_GD) XDMAC Channel 20 Disable Bit Mask */
#define XDMAC_GD_DI21_Pos                     (21)                                           /**< (XDMAC_GD) XDMAC Channel 21 Disable Bit Position */
#define XDMAC_GD_DI21_Msk                     (0x1U << XDMAC_GD_DI21_Pos)                    /**< (XDMAC_GD) XDMAC Channel 21 Disable Bit Mask */
#define XDMAC_GD_DI22_Pos                     (22)                                           /**< (XDMAC_GD) XDMAC Channel 22 Disable Bit Position */
#define XDMAC_GD_DI22_Msk                     (0x1U << XDMAC_GD_DI22_Pos)                    /**< (XDMAC_GD) XDMAC Channel 22 Disable Bit Mask */
#define XDMAC_GD_DI23_Pos                     (23)                                           /**< (XDMAC_GD) XDMAC Channel 23 Disable Bit Position */
#define XDMAC_GD_DI23_Msk                     (0x1U << XDMAC_GD_DI23_Pos)                    /**< (XDMAC_GD) XDMAC Channel 23 Disable Bit Mask */
#define XDMAC_GD_Msk                          (0x00FFFFFFUL)                                 /**< (XDMAC_GD) Register Mask  */
#define XDMAC_GD_DI_Pos                       (0)                                            /**< (XDMAC_GD Position) XDMAC Channel 23 Disable Bit */
#define XDMAC_GD_DI_Msk                       (0xFFFFFFU << XDMAC_GD_DI_Pos)                 /**< (XDMAC_GD Mask) DI */
#define XDMAC_GD_DI(value)                    (XDMAC_GD_DI_Msk & ((value) << XDMAC_GD_DI_Pos))

/* -------- XDMAC_GS : (XDMAC Offset: 0x24) (R/ 32) Global Channel Status Register -------- */

typedef union
{
  struct
  {
    uint32_t ST0:1;                     /**< bit:      0  XDMAC Channel 0 Status Bit                    */
    uint32_t ST1:1;                     /**< bit:      1  XDMAC Channel 1 Status Bit                    */
    uint32_t ST2:1;                     /**< bit:      2  XDMAC Channel 2 Status Bit                    */
    uint32_t ST3:1;                     /**< bit:      3  XDMAC Channel 3 Status Bit                    */
    uint32_t ST4:1;                     /**< bit:      4  XDMAC Channel 4 Status Bit                    */
    uint32_t ST5:1;                     /**< bit:      5  XDMAC Channel 5 Status Bit                    */
    uint32_t ST6:1;                     /**< bit:      6  XDMAC Channel 6 Status Bit                    */
    uint32_t ST7:1;                     /**< bit:      7  XDMAC Channel 7 Status Bit                    */
    uint32_t ST8:1;                     /**< bit:      8  XDMAC Channel 8 Status Bit                    */
    uint32_t ST9:1;                     /**< bit:      9  XDMAC Channel 9 Status Bit                    */
    uint32_t ST10:1;                    /**< bit:     10  XDMAC Channel 10 Status Bit                   */
    uint32_t ST11:1;                    /**< bit:     11  XDMAC Channel 11 Status Bit                   */
    uint32_t ST12:1;                    /**< bit:     12  XDMAC Channel 12 Status Bit                   */
    uint32_t ST13:1;                    /**< bit:     13  XDMAC Channel 13 Status Bit                   */
    uint32_t ST14:1;                    /**< bit:     14  XDMAC Channel 14 Status Bit                   */
    uint32_t ST15:1;                    /**< bit:     15  XDMAC Channel 15 Status Bit                   */
    uint32_t ST16:1;                    /**< bit:     16  XDMAC Channel 16 Status Bit                   */
    uint32_t ST17:1;                    /**< bit:     17  XDMAC Channel 17 Status Bit                   */
    uint32_t ST18:1;                    /**< bit:     18  XDMAC Channel 18 Status Bit                   */
    uint32_t ST19:1;                    /**< bit:     19  XDMAC Channel 19 Status Bit                   */
    uint32_t ST20:1;                    /**< bit:     20  XDMAC Channel 20 Status Bit                   */
    uint32_t ST21:1;                    /**< bit:     21  XDMAC Channel 21 Status Bit                   */
    uint32_t ST22:1;                    /**< bit:     22  XDMAC Channel 22 Status Bit                   */
    uint32_t ST23:1;                    /**< bit:     23  XDMAC Channel 23 Status Bit                   */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t ST:24;                     /**< bit:  0..23  XDMAC Channel 23 Status Bit                   */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GS_bits_t;

#define XDMAC_GS_ST0_Pos                      (0)                                            /**< (XDMAC_GS) XDMAC Channel 0 Status Bit Position */
#define XDMAC_GS_ST0_Msk                      (0x1U << XDMAC_GS_ST0_Pos)                     /**< (XDMAC_GS) XDMAC Channel 0 Status Bit Mask */
#define XDMAC_GS_ST1_Pos                      (1)                                            /**< (XDMAC_GS) XDMAC Channel 1 Status Bit Position */
#define XDMAC_GS_ST1_Msk                      (0x1U << XDMAC_GS_ST1_Pos)                     /**< (XDMAC_GS) XDMAC Channel 1 Status Bit Mask */
#define XDMAC_GS_ST2_Pos                      (2)                                            /**< (XDMAC_GS) XDMAC Channel 2 Status Bit Position */
#define XDMAC_GS_ST2_Msk                      (0x1U << XDMAC_GS_ST2_Pos)                     /**< (XDMAC_GS) XDMAC Channel 2 Status Bit Mask */
#define XDMAC_GS_ST3_Pos                      (3)                                            /**< (XDMAC_GS) XDMAC Channel 3 Status Bit Position */
#define XDMAC_GS_ST3_Msk                      (0x1U << XDMAC_GS_ST3_Pos)                     /**< (XDMAC_GS) XDMAC Channel 3 Status Bit Mask */
#define XDMAC_GS_ST4_Pos                      (4)                                            /**< (XDMAC_GS) XDMAC Channel 4 Status Bit Position */
#define XDMAC_GS_ST4_Msk                      (0x1U << XDMAC_GS_ST4_Pos)                     /**< (XDMAC_GS) XDMAC Channel 4 Status Bit Mask */
#define XDMAC_GS_ST5_Pos                      (5)                                            /**< (XDMAC_GS) XDMAC Channel 5 Status Bit Position */
#define XDMAC_GS_ST5_Msk                      (0x1U << XDMAC_GS_ST5_Pos)                     /**< (XDMAC_GS) XDMAC Channel 5 Status Bit Mask */
#define XDMAC_GS_ST6_Pos                      (6)                                            /**< (XDMAC_GS) XDMAC Channel 6 Status Bit Position */
#define XDMAC_GS_ST6_Msk                      (0x1U << XDMAC_GS_ST6_Pos)                     /**< (XDMAC_GS) XDMAC Channel 6 Status Bit Mask */
#define XDMAC_GS_ST7_Pos                      (7)                                            /**< (XDMAC_GS) XDMAC Channel 7 Status Bit Position */
#define XDMAC_GS_ST7_Msk                      (0x1U << XDMAC_GS_ST7_Pos)                     /**< (XDMAC_GS) XDMAC Channel 7 Status Bit Mask */
#define XDMAC_GS_ST8_Pos                      (8)                                            /**< (XDMAC_GS) XDMAC Channel 8 Status Bit Position */
#define XDMAC_GS_ST8_Msk                      (0x1U << XDMAC_GS_ST8_Pos)                     /**< (XDMAC_GS) XDMAC Channel 8 Status Bit Mask */
#define XDMAC_GS_ST9_Pos                      (9)                                            /**< (XDMAC_GS) XDMAC Channel 9 Status Bit Position */
#define XDMAC_GS_ST9_Msk                      (0x1U << XDMAC_GS_ST9_Pos)                     /**< (XDMAC_GS) XDMAC Channel 9 Status Bit Mask */
#define XDMAC_GS_ST10_Pos                     (10)                                           /**< (XDMAC_GS) XDMAC Channel 10 Status Bit Position */
#define XDMAC_GS_ST10_Msk                     (0x1U << XDMAC_GS_ST10_Pos)                    /**< (XDMAC_GS) XDMAC Channel 10 Status Bit Mask */
#define XDMAC_GS_ST11_Pos                     (11)                                           /**< (XDMAC_GS) XDMAC Channel 11 Status Bit Position */
#define XDMAC_GS_ST11_Msk                     (0x1U << XDMAC_GS_ST11_Pos)                    /**< (XDMAC_GS) XDMAC Channel 11 Status Bit Mask */
#define XDMAC_GS_ST12_Pos                     (12)                                           /**< (XDMAC_GS) XDMAC Channel 12 Status Bit Position */
#define XDMAC_GS_ST12_Msk                     (0x1U << XDMAC_GS_ST12_Pos)                    /**< (XDMAC_GS) XDMAC Channel 12 Status Bit Mask */
#define XDMAC_GS_ST13_Pos                     (13)                                           /**< (XDMAC_GS) XDMAC Channel 13 Status Bit Position */
#define XDMAC_GS_ST13_Msk                     (0x1U << XDMAC_GS_ST13_Pos)                    /**< (XDMAC_GS) XDMAC Channel 13 Status Bit Mask */
#define XDMAC_GS_ST14_Pos                     (14)                                           /**< (XDMAC_GS) XDMAC Channel 14 Status Bit Position */
#define XDMAC_GS_ST14_Msk                     (0x1U << XDMAC_GS_ST14_Pos)                    /**< (XDMAC_GS) XDMAC Channel 14 Status Bit Mask */
#define XDMAC_GS_ST15_Pos                     (15)                                           /**< (XDMAC_GS) XDMAC Channel 15 Status Bit Position */
#define XDMAC_GS_ST15_Msk                     (0x1U << XDMAC_GS_ST15_Pos)                    /**< (XDMAC_GS) XDMAC Channel 15 Status Bit Mask */
#define XDMAC_GS_ST16_Pos                     (16)                                           /**< (XDMAC_GS) XDMAC Channel 16 Status Bit Position */
#define XDMAC_GS_ST16_Msk                     (0x1U << XDMAC_GS_ST16_Pos)                    /**< (XDMAC_GS) XDMAC Channel 16 Status Bit Mask */
#define XDMAC_GS_ST17_Pos                     (17)                                           /**< (XDMAC_GS) XDMAC Channel 17 Status Bit Position */
#define XDMAC_GS_ST17_Msk                     (0x1U << XDMAC_GS_ST17_Pos)                    /**< (XDMAC_GS) XDMAC Channel 17 Status Bit Mask */
#define XDMAC_GS_ST18_Pos                     (18)                                           /**< (XDMAC_GS) XDMAC Channel 18 Status Bit Position */
#define XDMAC_GS_ST18_Msk                     (0x1U << XDMAC_GS_ST18_Pos)                    /**< (XDMAC_GS) XDMAC Channel 18 Status Bit Mask */
#define XDMAC_GS_ST19_Pos                     (19)                                           /**< (XDMAC_GS) XDMAC Channel 19 Status Bit Position */
#define XDMAC_GS_ST19_Msk                     (0x1U << XDMAC_GS_ST19_Pos)                    /**< (XDMAC_GS) XDMAC Channel 19 Status Bit Mask */
#define XDMAC_GS_ST20_Pos                     (20)                                           /**< (XDMAC_GS) XDMAC Channel 20 Status Bit Position */
#define XDMAC_GS_ST20_Msk                     (0x1U << XDMAC_GS_ST20_Pos)                    /**< (XDMAC_GS) XDMAC Channel 20 Status Bit Mask */
#define XDMAC_GS_ST21_Pos                     (21)                                           /**< (XDMAC_GS) XDMAC Channel 21 Status Bit Position */
#define XDMAC_GS_ST21_Msk                     (0x1U << XDMAC_GS_ST21_Pos)                    /**< (XDMAC_GS) XDMAC Channel 21 Status Bit Mask */
#define XDMAC_GS_ST22_Pos                     (22)                                           /**< (XDMAC_GS) XDMAC Channel 22 Status Bit Position */
#define XDMAC_GS_ST22_Msk                     (0x1U << XDMAC_GS_ST22_Pos)                    /**< (XDMAC_GS) XDMAC Channel 22 Status Bit Mask */
#define XDMAC_GS_ST23_Pos                     (23)                                           /**< (XDMAC_GS) XDMAC Channel 23 Status Bit Position */
#define XDMAC_GS_ST23_Msk                     (0x1U << XDMAC_GS_ST23_Pos)                    /**< (XDMAC_GS) XDMAC Channel 23 Status Bit Mask */
#define XDMAC_GS_Msk                          (0x00FFFFFFUL)                                 /**< (XDMAC_GS) Register Mask  */
#define XDMAC_GS_ST_Pos                       (0)                                            /**< (XDMAC_GS Position) XDMAC Channel 23 Status Bit */
#define XDMAC_GS_ST_Msk                       (0xFFFFFFU << XDMAC_GS_ST_Pos)                 /**< (XDMAC_GS Mask) ST */
#define XDMAC_GS_ST(value)                    (XDMAC_GS_ST_Msk & ((value) << XDMAC_GS_ST_Pos))

/* -------- XDMAC_GRS : (XDMAC Offset: 0x28) (R/W 32) Global Channel Read Suspend Register -------- */

typedef union
{
  struct
  {
    uint32_t RS0:1;                     /**< bit:      0  XDMAC Channel 0 Read Suspend Bit              */
    uint32_t RS1:1;                     /**< bit:      1  XDMAC Channel 1 Read Suspend Bit              */
    uint32_t RS2:1;                     /**< bit:      2  XDMAC Channel 2 Read Suspend Bit              */
    uint32_t RS3:1;                     /**< bit:      3  XDMAC Channel 3 Read Suspend Bit              */
    uint32_t RS4:1;                     /**< bit:      4  XDMAC Channel 4 Read Suspend Bit              */
    uint32_t RS5:1;                     /**< bit:      5  XDMAC Channel 5 Read Suspend Bit              */
    uint32_t RS6:1;                     /**< bit:      6  XDMAC Channel 6 Read Suspend Bit              */
    uint32_t RS7:1;                     /**< bit:      7  XDMAC Channel 7 Read Suspend Bit              */
    uint32_t RS8:1;                     /**< bit:      8  XDMAC Channel 8 Read Suspend Bit              */
    uint32_t RS9:1;                     /**< bit:      9  XDMAC Channel 9 Read Suspend Bit              */
    uint32_t RS10:1;                    /**< bit:     10  XDMAC Channel 10 Read Suspend Bit             */
    uint32_t RS11:1;                    /**< bit:     11  XDMAC Channel 11 Read Suspend Bit             */
    uint32_t RS12:1;                    /**< bit:     12  XDMAC Channel 12 Read Suspend Bit             */
    uint32_t RS13:1;                    /**< bit:     13  XDMAC Channel 13 Read Suspend Bit             */
    uint32_t RS14:1;                    /**< bit:     14  XDMAC Channel 14 Read Suspend Bit             */
    uint32_t RS15:1;                    /**< bit:     15  XDMAC Channel 15 Read Suspend Bit             */
    uint32_t RS16:1;                    /**< bit:     16  XDMAC Channel 16 Read Suspend Bit             */
    uint32_t RS17:1;                    /**< bit:     17  XDMAC Channel 17 Read Suspend Bit             */
    uint32_t RS18:1;                    /**< bit:     18  XDMAC Channel 18 Read Suspend Bit             */
    uint32_t RS19:1;                    /**< bit:     19  XDMAC Channel 19 Read Suspend Bit             */
    uint32_t RS20:1;                    /**< bit:     20  XDMAC Channel 20 Read Suspend Bit             */
    uint32_t RS21:1;                    /**< bit:     21  XDMAC Channel 21 Read Suspend Bit             */
    uint32_t RS22:1;                    /**< bit:     22  XDMAC Channel 22 Read Suspend Bit             */
    uint32_t RS23:1;                    /**< bit:     23  XDMAC Channel 23 Read Suspend Bit             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t RS:24;                     /**< bit:  0..23  XDMAC Channel 23 Read Suspend Bit             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GRS_bits_t;

