zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/xdmac.h
#define XDMAC_GRS_RS0_Pos                     (0)                                            /**< (XDMAC_GRS) XDMAC Channel 0 Read Suspend Bit Position */
#define XDMAC_GRS_RS0_Msk                     (0x1U << XDMAC_GRS_RS0_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 0 Read Suspend Bit Mask */
#define XDMAC_GRS_RS1_Pos                     (1)                                            /**< (XDMAC_GRS) XDMAC Channel 1 Read Suspend Bit Position */
#define XDMAC_GRS_RS1_Msk                     (0x1U << XDMAC_GRS_RS1_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 1 Read Suspend Bit Mask */
#define XDMAC_GRS_RS2_Pos                     (2)                                            /**< (XDMAC_GRS) XDMAC Channel 2 Read Suspend Bit Position */
#define XDMAC_GRS_RS2_Msk                     (0x1U << XDMAC_GRS_RS2_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 2 Read Suspend Bit Mask */
#define XDMAC_GRS_RS3_Pos                     (3)                                            /**< (XDMAC_GRS) XDMAC Channel 3 Read Suspend Bit Position */
#define XDMAC_GRS_RS3_Msk                     (0x1U << XDMAC_GRS_RS3_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 3 Read Suspend Bit Mask */
#define XDMAC_GRS_RS4_Pos                     (4)                                            /**< (XDMAC_GRS) XDMAC Channel 4 Read Suspend Bit Position */
#define XDMAC_GRS_RS4_Msk                     (0x1U << XDMAC_GRS_RS4_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 4 Read Suspend Bit Mask */
#define XDMAC_GRS_RS5_Pos                     (5)                                            /**< (XDMAC_GRS) XDMAC Channel 5 Read Suspend Bit Position */
#define XDMAC_GRS_RS5_Msk                     (0x1U << XDMAC_GRS_RS5_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 5 Read Suspend Bit Mask */
#define XDMAC_GRS_RS6_Pos                     (6)                                            /**< (XDMAC_GRS) XDMAC Channel 6 Read Suspend Bit Position */
#define XDMAC_GRS_RS6_Msk                     (0x1U << XDMAC_GRS_RS6_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 6 Read Suspend Bit Mask */
#define XDMAC_GRS_RS7_Pos                     (7)                                            /**< (XDMAC_GRS) XDMAC Channel 7 Read Suspend Bit Position */
#define XDMAC_GRS_RS7_Msk                     (0x1U << XDMAC_GRS_RS7_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 7 Read Suspend Bit Mask */
#define XDMAC_GRS_RS8_Pos                     (8)                                            /**< (XDMAC_GRS) XDMAC Channel 8 Read Suspend Bit Position */
#define XDMAC_GRS_RS8_Msk                     (0x1U << XDMAC_GRS_RS8_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 8 Read Suspend Bit Mask */
#define XDMAC_GRS_RS9_Pos                     (9)                                            /**< (XDMAC_GRS) XDMAC Channel 9 Read Suspend Bit Position */
#define XDMAC_GRS_RS9_Msk                     (0x1U << XDMAC_GRS_RS9_Pos)                    /**< (XDMAC_GRS) XDMAC Channel 9 Read Suspend Bit Mask */
#define XDMAC_GRS_RS10_Pos                    (10)                                           /**< (XDMAC_GRS) XDMAC Channel 10 Read Suspend Bit Position */
#define XDMAC_GRS_RS10_Msk                    (0x1U << XDMAC_GRS_RS10_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 10 Read Suspend Bit Mask */
#define XDMAC_GRS_RS11_Pos                    (11)                                           /**< (XDMAC_GRS) XDMAC Channel 11 Read Suspend Bit Position */
#define XDMAC_GRS_RS11_Msk                    (0x1U << XDMAC_GRS_RS11_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 11 Read Suspend Bit Mask */
#define XDMAC_GRS_RS12_Pos                    (12)                                           /**< (XDMAC_GRS) XDMAC Channel 12 Read Suspend Bit Position */
#define XDMAC_GRS_RS12_Msk                    (0x1U << XDMAC_GRS_RS12_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 12 Read Suspend Bit Mask */
#define XDMAC_GRS_RS13_Pos                    (13)                                           /**< (XDMAC_GRS) XDMAC Channel 13 Read Suspend Bit Position */
#define XDMAC_GRS_RS13_Msk                    (0x1U << XDMAC_GRS_RS13_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 13 Read Suspend Bit Mask */
#define XDMAC_GRS_RS14_Pos                    (14)                                           /**< (XDMAC_GRS) XDMAC Channel 14 Read Suspend Bit Position */
#define XDMAC_GRS_RS14_Msk                    (0x1U << XDMAC_GRS_RS14_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 14 Read Suspend Bit Mask */
#define XDMAC_GRS_RS15_Pos                    (15)                                           /**< (XDMAC_GRS) XDMAC Channel 15 Read Suspend Bit Position */
#define XDMAC_GRS_RS15_Msk                    (0x1U << XDMAC_GRS_RS15_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 15 Read Suspend Bit Mask */
#define XDMAC_GRS_RS16_Pos                    (16)                                           /**< (XDMAC_GRS) XDMAC Channel 16 Read Suspend Bit Position */
#define XDMAC_GRS_RS16_Msk                    (0x1U << XDMAC_GRS_RS16_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 16 Read Suspend Bit Mask */
#define XDMAC_GRS_RS17_Pos                    (17)                                           /**< (XDMAC_GRS) XDMAC Channel 17 Read Suspend Bit Position */
#define XDMAC_GRS_RS17_Msk                    (0x1U << XDMAC_GRS_RS17_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 17 Read Suspend Bit Mask */
#define XDMAC_GRS_RS18_Pos                    (18)                                           /**< (XDMAC_GRS) XDMAC Channel 18 Read Suspend Bit Position */
#define XDMAC_GRS_RS18_Msk                    (0x1U << XDMAC_GRS_RS18_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 18 Read Suspend Bit Mask */
#define XDMAC_GRS_RS19_Pos                    (19)                                           /**< (XDMAC_GRS) XDMAC Channel 19 Read Suspend Bit Position */
#define XDMAC_GRS_RS19_Msk                    (0x1U << XDMAC_GRS_RS19_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 19 Read Suspend Bit Mask */
#define XDMAC_GRS_RS20_Pos                    (20)                                           /**< (XDMAC_GRS) XDMAC Channel 20 Read Suspend Bit Position */
#define XDMAC_GRS_RS20_Msk                    (0x1U << XDMAC_GRS_RS20_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 20 Read Suspend Bit Mask */
#define XDMAC_GRS_RS21_Pos                    (21)                                           /**< (XDMAC_GRS) XDMAC Channel 21 Read Suspend Bit Position */
#define XDMAC_GRS_RS21_Msk                    (0x1U << XDMAC_GRS_RS21_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 21 Read Suspend Bit Mask */
#define XDMAC_GRS_RS22_Pos                    (22)                                           /**< (XDMAC_GRS) XDMAC Channel 22 Read Suspend Bit Position */
#define XDMAC_GRS_RS22_Msk                    (0x1U << XDMAC_GRS_RS22_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 22 Read Suspend Bit Mask */
#define XDMAC_GRS_RS23_Pos                    (23)                                           /**< (XDMAC_GRS) XDMAC Channel 23 Read Suspend Bit Position */
#define XDMAC_GRS_RS23_Msk                    (0x1U << XDMAC_GRS_RS23_Pos)                   /**< (XDMAC_GRS) XDMAC Channel 23 Read Suspend Bit Mask */
#define XDMAC_GRS_Msk                         (0x00FFFFFFUL)                                 /**< (XDMAC_GRS) Register Mask  */
#define XDMAC_GRS_RS_Pos                      (0)                                            /**< (XDMAC_GRS Position) XDMAC Channel 23 Read Suspend Bit */
#define XDMAC_GRS_RS_Msk                      (0xFFFFFFU << XDMAC_GRS_RS_Pos)                /**< (XDMAC_GRS Mask) RS */
#define XDMAC_GRS_RS(value)                   (XDMAC_GRS_RS_Msk & ((value) << XDMAC_GRS_RS_Pos))

/* -------- XDMAC_GWS : (XDMAC Offset: 0x2c) (R/W 32) Global Channel Write Suspend Register -------- */

typedef union
{
  struct
  {
    uint32_t WS0:1;                     /**< bit:      0  XDMAC Channel 0 Write Suspend Bit             */
    uint32_t WS1:1;                     /**< bit:      1  XDMAC Channel 1 Write Suspend Bit             */
    uint32_t WS2:1;                     /**< bit:      2  XDMAC Channel 2 Write Suspend Bit             */
    uint32_t WS3:1;                     /**< bit:      3  XDMAC Channel 3 Write Suspend Bit             */
    uint32_t WS4:1;                     /**< bit:      4  XDMAC Channel 4 Write Suspend Bit             */
    uint32_t WS5:1;                     /**< bit:      5  XDMAC Channel 5 Write Suspend Bit             */
    uint32_t WS6:1;                     /**< bit:      6  XDMAC Channel 6 Write Suspend Bit             */
    uint32_t WS7:1;                     /**< bit:      7  XDMAC Channel 7 Write Suspend Bit             */
    uint32_t WS8:1;                     /**< bit:      8  XDMAC Channel 8 Write Suspend Bit             */
    uint32_t WS9:1;                     /**< bit:      9  XDMAC Channel 9 Write Suspend Bit             */
    uint32_t WS10:1;                    /**< bit:     10  XDMAC Channel 10 Write Suspend Bit            */
    uint32_t WS11:1;                    /**< bit:     11  XDMAC Channel 11 Write Suspend Bit            */
    uint32_t WS12:1;                    /**< bit:     12  XDMAC Channel 12 Write Suspend Bit            */
    uint32_t WS13:1;                    /**< bit:     13  XDMAC Channel 13 Write Suspend Bit            */
    uint32_t WS14:1;                    /**< bit:     14  XDMAC Channel 14 Write Suspend Bit            */
    uint32_t WS15:1;                    /**< bit:     15  XDMAC Channel 15 Write Suspend Bit            */
    uint32_t WS16:1;                    /**< bit:     16  XDMAC Channel 16 Write Suspend Bit            */
    uint32_t WS17:1;                    /**< bit:     17  XDMAC Channel 17 Write Suspend Bit            */
    uint32_t WS18:1;                    /**< bit:     18  XDMAC Channel 18 Write Suspend Bit            */
    uint32_t WS19:1;                    /**< bit:     19  XDMAC Channel 19 Write Suspend Bit            */
    uint32_t WS20:1;                    /**< bit:     20  XDMAC Channel 20 Write Suspend Bit            */
    uint32_t WS21:1;                    /**< bit:     21  XDMAC Channel 21 Write Suspend Bit            */
    uint32_t WS22:1;                    /**< bit:     22  XDMAC Channel 22 Write Suspend Bit            */
    uint32_t WS23:1;                    /**< bit:     23  XDMAC Channel 23 Write Suspend Bit            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t WS:24;                     /**< bit:  0..23  XDMAC Channel 23 Write Suspend Bit            */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GWS_bits_t;

#define XDMAC_GWS_WS0_Pos                     (0)                                            /**< (XDMAC_GWS) XDMAC Channel 0 Write Suspend Bit Position */
#define XDMAC_GWS_WS0_Msk                     (0x1U << XDMAC_GWS_WS0_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 0 Write Suspend Bit Mask */
#define XDMAC_GWS_WS1_Pos                     (1)                                            /**< (XDMAC_GWS) XDMAC Channel 1 Write Suspend Bit Position */
#define XDMAC_GWS_WS1_Msk                     (0x1U << XDMAC_GWS_WS1_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 1 Write Suspend Bit Mask */
#define XDMAC_GWS_WS2_Pos                     (2)                                            /**< (XDMAC_GWS) XDMAC Channel 2 Write Suspend Bit Position */
#define XDMAC_GWS_WS2_Msk                     (0x1U << XDMAC_GWS_WS2_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 2 Write Suspend Bit Mask */
#define XDMAC_GWS_WS3_Pos                     (3)                                            /**< (XDMAC_GWS) XDMAC Channel 3 Write Suspend Bit Position */
#define XDMAC_GWS_WS3_Msk                     (0x1U << XDMAC_GWS_WS3_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 3 Write Suspend Bit Mask */
#define XDMAC_GWS_WS4_Pos                     (4)                                            /**< (XDMAC_GWS) XDMAC Channel 4 Write Suspend Bit Position */
#define XDMAC_GWS_WS4_Msk                     (0x1U << XDMAC_GWS_WS4_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 4 Write Suspend Bit Mask */
#define XDMAC_GWS_WS5_Pos                     (5)                                            /**< (XDMAC_GWS) XDMAC Channel 5 Write Suspend Bit Position */
#define XDMAC_GWS_WS5_Msk                     (0x1U << XDMAC_GWS_WS5_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 5 Write Suspend Bit Mask */
#define XDMAC_GWS_WS6_Pos                     (6)                                            /**< (XDMAC_GWS) XDMAC Channel 6 Write Suspend Bit Position */
#define XDMAC_GWS_WS6_Msk                     (0x1U << XDMAC_GWS_WS6_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 6 Write Suspend Bit Mask */
#define XDMAC_GWS_WS7_Pos                     (7)                                            /**< (XDMAC_GWS) XDMAC Channel 7 Write Suspend Bit Position */
#define XDMAC_GWS_WS7_Msk                     (0x1U << XDMAC_GWS_WS7_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 7 Write Suspend Bit Mask */
#define XDMAC_GWS_WS8_Pos                     (8)                                            /**< (XDMAC_GWS) XDMAC Channel 8 Write Suspend Bit Position */
#define XDMAC_GWS_WS8_Msk                     (0x1U << XDMAC_GWS_WS8_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 8 Write Suspend Bit Mask */
#define XDMAC_GWS_WS9_Pos                     (9)                                            /**< (XDMAC_GWS) XDMAC Channel 9 Write Suspend Bit Position */
#define XDMAC_GWS_WS9_Msk                     (0x1U << XDMAC_GWS_WS9_Pos)                    /**< (XDMAC_GWS) XDMAC Channel 9 Write Suspend Bit Mask */
#define XDMAC_GWS_WS10_Pos                    (10)                                           /**< (XDMAC_GWS) XDMAC Channel 10 Write Suspend Bit Position */
#define XDMAC_GWS_WS10_Msk                    (0x1U << XDMAC_GWS_WS10_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 10 Write Suspend Bit Mask */
#define XDMAC_GWS_WS11_Pos                    (11)                                           /**< (XDMAC_GWS) XDMAC Channel 11 Write Suspend Bit Position */
#define XDMAC_GWS_WS11_Msk                    (0x1U << XDMAC_GWS_WS11_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 11 Write Suspend Bit Mask */
#define XDMAC_GWS_WS12_Pos                    (12)                                           /**< (XDMAC_GWS) XDMAC Channel 12 Write Suspend Bit Position */
#define XDMAC_GWS_WS12_Msk                    (0x1U << XDMAC_GWS_WS12_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 12 Write Suspend Bit Mask */
#define XDMAC_GWS_WS13_Pos                    (13)                                           /**< (XDMAC_GWS) XDMAC Channel 13 Write Suspend Bit Position */
#define XDMAC_GWS_WS13_Msk                    (0x1U << XDMAC_GWS_WS13_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 13 Write Suspend Bit Mask */
#define XDMAC_GWS_WS14_Pos                    (14)                                           /**< (XDMAC_GWS) XDMAC Channel 14 Write Suspend Bit Position */
#define XDMAC_GWS_WS14_Msk                    (0x1U << XDMAC_GWS_WS14_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 14 Write Suspend Bit Mask */
#define XDMAC_GWS_WS15_Pos                    (15)                                           /**< (XDMAC_GWS) XDMAC Channel 15 Write Suspend Bit Position */
#define XDMAC_GWS_WS15_Msk                    (0x1U << XDMAC_GWS_WS15_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 15 Write Suspend Bit Mask */
#define XDMAC_GWS_WS16_Pos                    (16)                                           /**< (XDMAC_GWS) XDMAC Channel 16 Write Suspend Bit Position */
#define XDMAC_GWS_WS16_Msk                    (0x1U << XDMAC_GWS_WS16_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 16 Write Suspend Bit Mask */
#define XDMAC_GWS_WS17_Pos                    (17)                                           /**< (XDMAC_GWS) XDMAC Channel 17 Write Suspend Bit Position */
#define XDMAC_GWS_WS17_Msk                    (0x1U << XDMAC_GWS_WS17_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 17 Write Suspend Bit Mask */
#define XDMAC_GWS_WS18_Pos                    (18)                                           /**< (XDMAC_GWS) XDMAC Channel 18 Write Suspend Bit Position */
#define XDMAC_GWS_WS18_Msk                    (0x1U << XDMAC_GWS_WS18_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 18 Write Suspend Bit Mask */
#define XDMAC_GWS_WS19_Pos                    (19)                                           /**< (XDMAC_GWS) XDMAC Channel 19 Write Suspend Bit Position */
#define XDMAC_GWS_WS19_Msk                    (0x1U << XDMAC_GWS_WS19_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 19 Write Suspend Bit Mask */
#define XDMAC_GWS_WS20_Pos                    (20)                                           /**< (XDMAC_GWS) XDMAC Channel 20 Write Suspend Bit Position */
#define XDMAC_GWS_WS20_Msk                    (0x1U << XDMAC_GWS_WS20_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 20 Write Suspend Bit Mask */
#define XDMAC_GWS_WS21_Pos                    (21)                                           /**< (XDMAC_GWS) XDMAC Channel 21 Write Suspend Bit Position */
#define XDMAC_GWS_WS21_Msk                    (0x1U << XDMAC_GWS_WS21_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 21 Write Suspend Bit Mask */
#define XDMAC_GWS_WS22_Pos                    (22)                                           /**< (XDMAC_GWS) XDMAC Channel 22 Write Suspend Bit Position */
#define XDMAC_GWS_WS22_Msk                    (0x1U << XDMAC_GWS_WS22_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 22 Write Suspend Bit Mask */
#define XDMAC_GWS_WS23_Pos                    (23)                                           /**< (XDMAC_GWS) XDMAC Channel 23 Write Suspend Bit Position */
#define XDMAC_GWS_WS23_Msk                    (0x1U << XDMAC_GWS_WS23_Pos)                   /**< (XDMAC_GWS) XDMAC Channel 23 Write Suspend Bit Mask */
#define XDMAC_GWS_Msk                         (0x00FFFFFFUL)                                 /**< (XDMAC_GWS) Register Mask  */
#define XDMAC_GWS_WS_Pos                      (0)                                            /**< (XDMAC_GWS Position) XDMAC Channel 23 Write Suspend Bit */
#define XDMAC_GWS_WS_Msk                      (0xFFFFFFU << XDMAC_GWS_WS_Pos)                /**< (XDMAC_GWS Mask) WS */
#define XDMAC_GWS_WS(value)                   (XDMAC_GWS_WS_Msk & ((value) << XDMAC_GWS_WS_Pos))

/* -------- XDMAC_GRWS : (XDMAC Offset: 0x30) (/W 32) Global Channel Read Write Suspend Register -------- */

typedef union
{
  struct
  {
    uint32_t RWS0:1;                    /**< bit:      0  XDMAC Channel 0 Read Write Suspend Bit        */
    uint32_t RWS1:1;                    /**< bit:      1  XDMAC Channel 1 Read Write Suspend Bit        */
    uint32_t RWS2:1;                    /**< bit:      2  XDMAC Channel 2 Read Write Suspend Bit        */
    uint32_t RWS3:1;                    /**< bit:      3  XDMAC Channel 3 Read Write Suspend Bit        */
    uint32_t RWS4:1;                    /**< bit:      4  XDMAC Channel 4 Read Write Suspend Bit        */
    uint32_t RWS5:1;                    /**< bit:      5  XDMAC Channel 5 Read Write Suspend Bit        */
    uint32_t RWS6:1;                    /**< bit:      6  XDMAC Channel 6 Read Write Suspend Bit        */
    uint32_t RWS7:1;                    /**< bit:      7  XDMAC Channel 7 Read Write Suspend Bit        */
    uint32_t RWS8:1;                    /**< bit:      8  XDMAC Channel 8 Read Write Suspend Bit        */
    uint32_t RWS9:1;                    /**< bit:      9  XDMAC Channel 9 Read Write Suspend Bit        */
    uint32_t RWS10:1;                   /**< bit:     10  XDMAC Channel 10 Read Write Suspend Bit       */
    uint32_t RWS11:1;                   /**< bit:     11  XDMAC Channel 11 Read Write Suspend Bit       */
    uint32_t RWS12:1;                   /**< bit:     12  XDMAC Channel 12 Read Write Suspend Bit       */
    uint32_t RWS13:1;                   /**< bit:     13  XDMAC Channel 13 Read Write Suspend Bit       */
    uint32_t RWS14:1;                   /**< bit:     14  XDMAC Channel 14 Read Write Suspend Bit       */
    uint32_t RWS15:1;                   /**< bit:     15  XDMAC Channel 15 Read Write Suspend Bit       */
    uint32_t RWS16:1;                   /**< bit:     16  XDMAC Channel 16 Read Write Suspend Bit       */
    uint32_t RWS17:1;                   /**< bit:     17  XDMAC Channel 17 Read Write Suspend Bit       */
    uint32_t RWS18:1;                   /**< bit:     18  XDMAC Channel 18 Read Write Suspend Bit       */
    uint32_t RWS19:1;                   /**< bit:     19  XDMAC Channel 19 Read Write Suspend Bit       */
    uint32_t RWS20:1;                   /**< bit:     20  XDMAC Channel 20 Read Write Suspend Bit       */
    uint32_t RWS21:1;                   /**< bit:     21  XDMAC Channel 21 Read Write Suspend Bit       */
    uint32_t RWS22:1;                   /**< bit:     22  XDMAC Channel 22 Read Write Suspend Bit       */
    uint32_t RWS23:1;                   /**< bit:     23  XDMAC Channel 23 Read Write Suspend Bit       */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t RWS:24;                    /**< bit:  0..23  XDMAC Channel 23 Read Write Suspend Bit       */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __XDMAC_GRWS_bits_t;

