zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/xdmac.h
/** \brief XDMAC_CHID register offsets definitions */
#define XDMAC_CIE_OFFSET             (0x00)         /**< (XDMAC_CIE) Channel Interrupt Enable Register (chid = 0) Offset */
#define XDMAC_CID_OFFSET             (0x04)         /**< (XDMAC_CID) Channel Interrupt Disable Register (chid = 0) Offset */
#define XDMAC_CIM_OFFSET             (0x08)         /**< (XDMAC_CIM) Channel Interrupt Mask Register (chid = 0) Offset */
#define XDMAC_CIS_OFFSET             (0x0C)         /**< (XDMAC_CIS) Channel Interrupt Status Register (chid = 0) Offset */
#define XDMAC_CSA_OFFSET             (0x10)         /**< (XDMAC_CSA) Channel Source Address Register (chid = 0) Offset */
#define XDMAC_CDA_OFFSET             (0x14)         /**< (XDMAC_CDA) Channel Destination Address Register (chid = 0) Offset */
#define XDMAC_CNDA_OFFSET            (0x18)         /**< (XDMAC_CNDA) Channel Next Descriptor Address Register (chid = 0) Offset */
#define XDMAC_CNDC_OFFSET            (0x1C)         /**< (XDMAC_CNDC) Channel Next Descriptor Control Register (chid = 0) Offset */
#define XDMAC_CUBC_OFFSET            (0x20)         /**< (XDMAC_CUBC) Channel Microblock Control Register (chid = 0) Offset */
#define XDMAC_CBC_OFFSET             (0x24)         /**< (XDMAC_CBC) Channel Block Control Register (chid = 0) Offset */
#define XDMAC_CC_OFFSET              (0x28)         /**< (XDMAC_CC) Channel Configuration Register (chid = 0) Offset */
#define XDMAC_CDS_MSP_OFFSET         (0x2C)         /**< (XDMAC_CDS_MSP) Channel Data Stride Memory Set Pattern (chid = 0) Offset */
#define XDMAC_CSUS_OFFSET            (0x30)         /**< (XDMAC_CSUS) Channel Source Microblock Stride (chid = 0) Offset */
#define XDMAC_CDUS_OFFSET            (0x34)         /**< (XDMAC_CDUS) Channel Destination Microblock Stride (chid = 0) Offset */
/** \brief XDMAC register offsets definitions */
#define XDMAC_GTYPE_OFFSET           (0x00)         /**< (XDMAC_GTYPE) Global Type Register Offset */
#define XDMAC_GCFG_OFFSET            (0x04)         /**< (XDMAC_GCFG) Global Configuration Register Offset */
#define XDMAC_GWAC_OFFSET            (0x08)         /**< (XDMAC_GWAC) Global Weighted Arbiter Configuration Register Offset */
#define XDMAC_GIE_OFFSET             (0x0C)         /**< (XDMAC_GIE) Global Interrupt Enable Register Offset */
#define XDMAC_GID_OFFSET             (0x10)         /**< (XDMAC_GID) Global Interrupt Disable Register Offset */
#define XDMAC_GIM_OFFSET             (0x14)         /**< (XDMAC_GIM) Global Interrupt Mask Register Offset */
#define XDMAC_GIS_OFFSET             (0x18)         /**< (XDMAC_GIS) Global Interrupt Status Register Offset */
#define XDMAC_GE_OFFSET              (0x1C)         /**< (XDMAC_GE) Global Channel Enable Register Offset */
#define XDMAC_GD_OFFSET              (0x20)         /**< (XDMAC_GD) Global Channel Disable Register Offset */
#define XDMAC_GS_OFFSET              (0x24)         /**< (XDMAC_GS) Global Channel Status Register Offset */
#define XDMAC_GRS_OFFSET             (0x28)         /**< (XDMAC_GRS) Global Channel Read Suspend Register Offset */
#define XDMAC_GWS_OFFSET             (0x2C)         /**< (XDMAC_GWS) Global Channel Write Suspend Register Offset */
#define XDMAC_GRWS_OFFSET            (0x30)         /**< (XDMAC_GRWS) Global Channel Read Write Suspend Register Offset */
#define XDMAC_GRWR_OFFSET            (0x34)         /**< (XDMAC_GRWR) Global Channel Read Write Resume Register Offset */
#define XDMAC_GSWR_OFFSET            (0x38)         /**< (XDMAC_GSWR) Global Channel Software Request Register Offset */
#define XDMAC_GSWS_OFFSET            (0x3C)         /**< (XDMAC_GSWS) Global Channel Software Request Status Register Offset */
#define XDMAC_GSWF_OFFSET            (0x40)         /**< (XDMAC_GSWF) Global Channel Software Flush Request Register Offset */

/** \brief XDMAC_CHID register API structure */
typedef struct
{
  __O   __XDMAC_CIE_bits_t             XDMAC_CIE;     /**< Offset: 0x00 ( /W  32) Channel Interrupt Enable Register (chid = 0) */
  __O   __XDMAC_CID_bits_t             XDMAC_CID;     /**< Offset: 0x04 ( /W  32) Channel Interrupt Disable Register (chid = 0) */
  __I   __XDMAC_CIM_bits_t             XDMAC_CIM;     /**< Offset: 0x08 (R/   32) Channel Interrupt Mask Register (chid = 0) */
  __I   __XDMAC_CIS_bits_t             XDMAC_CIS;     /**< Offset: 0x0C (R/   32) Channel Interrupt Status Register (chid = 0) */
  __IO  __XDMAC_CSA_bits_t             XDMAC_CSA;     /**< Offset: 0x10 (R/W  32) Channel Source Address Register (chid = 0) */
  __IO  __XDMAC_CDA_bits_t             XDMAC_CDA;     /**< Offset: 0x14 (R/W  32) Channel Destination Address Register (chid = 0) */
  __IO  __XDMAC_CNDA_bits_t            XDMAC_CNDA;    /**< Offset: 0x18 (R/W  32) Channel Next Descriptor Address Register (chid = 0) */
  __IO  __XDMAC_CNDC_bits_t            XDMAC_CNDC;    /**< Offset: 0x1C (R/W  32) Channel Next Descriptor Control Register (chid = 0) */
  __IO  __XDMAC_CUBC_bits_t            XDMAC_CUBC;    /**< Offset: 0x20 (R/W  32) Channel Microblock Control Register (chid = 0) */
  __IO  __XDMAC_CBC_bits_t             XDMAC_CBC;     /**< Offset: 0x24 (R/W  32) Channel Block Control Register (chid = 0) */
  __IO  __XDMAC_CC_bits_t              XDMAC_CC;      /**< Offset: 0x28 (R/W  32) Channel Configuration Register (chid = 0) */
  __IO  __XDMAC_CDS_MSP_bits_t         XDMAC_CDS_MSP; /**< Offset: 0x2C (R/W  32) Channel Data Stride Memory Set Pattern (chid = 0) */
  __IO  __XDMAC_CSUS_bits_t            XDMAC_CSUS;    /**< Offset: 0x30 (R/W  32) Channel Source Microblock Stride (chid = 0) */
  __IO  __XDMAC_CDUS_bits_t            XDMAC_CDUS;    /**< Offset: 0x34 (R/W  32) Channel Destination Microblock Stride (chid = 0) */
  __I   uint8_t                        Reserved1[0x08];
} xdmacchid_registers_t;

#define XDMACCHID_NUMBER 24
/** \brief XDMAC register API structure */
typedef struct
{
  __I   __XDMAC_GTYPE_bits_t           XDMAC_GTYPE;   /**< Offset: 0x00 (R/   32) Global Type Register */
  __IO  __XDMAC_GCFG_bits_t            XDMAC_GCFG;    /**< Offset: 0x04 (R/W  32) Global Configuration Register */
  __IO  __XDMAC_GWAC_bits_t            XDMAC_GWAC;    /**< Offset: 0x08 (R/W  32) Global Weighted Arbiter Configuration Register */
  __O   __XDMAC_GIE_bits_t             XDMAC_GIE;     /**< Offset: 0x0C ( /W  32) Global Interrupt Enable Register */
  __O   __XDMAC_GID_bits_t             XDMAC_GID;     /**< Offset: 0x10 ( /W  32) Global Interrupt Disable Register */
  __I   __XDMAC_GIM_bits_t             XDMAC_GIM;     /**< Offset: 0x14 (R/   32) Global Interrupt Mask Register */
  __I   __XDMAC_GIS_bits_t             XDMAC_GIS;     /**< Offset: 0x18 (R/   32) Global Interrupt Status Register */
  __O   __XDMAC_GE_bits_t              XDMAC_GE;      /**< Offset: 0x1C ( /W  32) Global Channel Enable Register */
  __O   __XDMAC_GD_bits_t              XDMAC_GD;      /**< Offset: 0x20 ( /W  32) Global Channel Disable Register */
  __I   __XDMAC_GS_bits_t              XDMAC_GS;      /**< Offset: 0x24 (R/   32) Global Channel Status Register */
  __IO  __XDMAC_GRS_bits_t             XDMAC_GRS;     /**< Offset: 0x28 (R/W  32) Global Channel Read Suspend Register */
  __IO  __XDMAC_GWS_bits_t             XDMAC_GWS;     /**< Offset: 0x2C (R/W  32) Global Channel Write Suspend Register */
  __O   __XDMAC_GRWS_bits_t            XDMAC_GRWS;    /**< Offset: 0x30 ( /W  32) Global Channel Read Write Suspend Register */
  __O   __XDMAC_GRWR_bits_t            XDMAC_GRWR;    /**< Offset: 0x34 ( /W  32) Global Channel Read Write Resume Register */
  __O   __XDMAC_GSWR_bits_t            XDMAC_GSWR;    /**< Offset: 0x38 ( /W  32) Global Channel Software Request Register */
  __I   __XDMAC_GSWS_bits_t            XDMAC_GSWS;    /**< Offset: 0x3C (R/   32) Global Channel Software Request Status Register */
  __O   __XDMAC_GSWF_bits_t            XDMAC_GSWF;    /**< Offset: 0x40 ( /W  32) Global Channel Software Flush Request Register */
  __I   uint8_t                        Reserved1[0x0C];
        xdmacchid_registers_t          XDMAC_CHID[XDMACCHID_NUMBER]; /**< Offset: 0x50 Channel Interrupt Enable Register (chid = 0) */
} xdmac_registers_t;
/** @}  end of Extensible DMA Controller */

#endif /* _PIC32CZ_CA70_XDMAC_COMPONENT_H_ */
